1 - import 

2 - Data wrangling

3 - export

# import

In [3]:
#import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
import os

In [4]:
#import data files
path = r'/Users/amritambe/Desktop/CareerF Python/Insta Cart Analysis'
df = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'Grouped_Customer.pkl'))
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'original Data', 'customers.csv'))
df.isnull().sum()

Unnamed: 0.1                     0
Unnamed: 0_x                     0
order_id                         0
customer_id                      0
customer_order_number            0
orders_day_of_week               0
order_hour_of_day                0
days_between_last_order    2078084
first_order                      0
product_id                       0
add_to_cart_order                0
reordered                        0
Unnamed: 0_y                     0
product_name                 28171
aisle_id                         0
department_id                    0
prices                        5127
_merge                           0
price_range_loc                  0
Busiest Days                     0
busiest_hours_of_day             0
max_orders                       0
loyalty_flag                     0
avg_cust_spend                   0
Customer_Spend                   0
median_order_frequency           0
Order_Frequency                  0
dtype: int64

In [4]:
df_prod = pd.read_csv(os.path.join(path, '02 Data', 'original Data', 'products.csv'))

# Data Wrangling

In [5]:
df.columns.tolist()

['Unnamed: 0.1',
 'Unnamed: 0_x',
 'order_id',
 'customer_id',
 'customer_order_number',
 'orders_day_of_week',
 'order_hour_of_day',
 'days_between_last_order',
 'first_order',
 'product_id',
 'add_to_cart_order',
 'reordered',
 'Unnamed: 0_y',
 'product_name',
 'aisle_id',
 'department_id',
 'prices',
 '_merge',
 'price_range_loc',
 'Busiest Days',
 'busiest_hours_of_day',
 'max_orders',
 'loyalty_flag',
 'avg_cust_spend',
 'Customer_Spend',
 'median_order_frequency',
 'Order_Frequency']

In [6]:
df_cust.isnull().sum()

user_id             0
First Name      11259
Surnam              0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [7]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
#rename columns
df_cust.rename(columns={'Surnam':'Last Name', 'STATE':'State', 'n_dependants':'dependants', 'fam_status':'marital_status'}, inplace=True)

In [9]:
df_cust.head(), df_cust.shape

(   user_id First Name Last Name  Gender       State  Age date_joined  \
 0    26711    Deborah  Esquivel  Female    Missouri   48    1/1/2017
 1    33890   Patricia      Hart  Female  New Mexico   36    1/1/2017
 2    65803    Kenneth    Farley    Male       Idaho   35    1/1/2017
 3   125935   Michelle     Hicks  Female        Iowa   40    1/1/2017
 4   130797        Ann   Gilmore  Female    Maryland   26    1/1/2017

    dependants marital_status  income
 0           3        married  165665
 1           0         single   59285
 2           2        married   99568
 3           0         single   42049
 4           1        married   40374  ,
 (206209, 10))

In [10]:
df_cust.describe()

             user_id            Age     dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [11]:
df_cust['date_joined'].min(), df_cust['date_joined'].max()

('1/1/2017', '9/9/2019')

In [12]:
# Drop Columns

In [13]:
df_cust.drop(columns='date_joined', inplace=True)

In [14]:
df_cust.drop(columns='First Name', inplace=True)

In [15]:
df_cust.drop(columns='Last Name', inplace=True)

In [16]:
df_cust.head()

   user_id  Gender       State  Age  dependants marital_status  income
0    26711  Female    Missouri   48           3        married  165665
1    33890  Female  New Mexico   36           0         single   59285
2    65803    Male       Idaho   35           2        married   99568
3   125935  Female        Iowa   40           0         single   42049
4   130797  Female    Maryland   26           1        married   40374

In [17]:
#rename columns, prep for merging
df_cust.rename(columns={'user_id':'customer_id'}, inplace=True)

In [18]:
df_cust.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'Customers_Clean.csv'))

In [19]:
df.shape, df_cust.shape, df['customer_id'].describe()

((32434212, 27),
 (206209, 7),
 count    3.243421e+07
 mean     1.029374e+05
 std      5.946649e+04
 min      1.000000e+00
 25%      5.142000e+04
 50%      1.026125e+05
 75%      1.543910e+05
 max      2.062090e+05
 Name: customer_id, dtype: float64)

In [20]:
#merging customer dataset to the full dataset
df_full = pd.merge(df, df_cust, on='customer_id', how='left')

In [21]:
df_full.isnull().sum()

Unnamed: 0.1                     0
Unnamed: 0_x                     0
order_id                         0
customer_id                      0
customer_order_number            0
orders_day_of_week               0
order_hour_of_day                0
days_between_last_order    2078084
first_order                      0
product_id                       0
add_to_cart_order                0
reordered                        0
Unnamed: 0_y                     0
product_name                 28171
aisle_id                         0
department_id                    0
prices                        5127
_merge                           0
price_range_loc                  0
Busiest Days                     0
busiest_hours_of_day             0
max_orders                       0
loyalty_flag                     0
avg_cust_spend                   0
Customer_Spend                   0
median_order_frequency           0
Order_Frequency                  0
Gender                           0
State                            0
Age                              0
dependants                       0
marital_status                   0
income                           0
dtype: int64

Exploring the product name null values, the products.csv contains 16 nulls, so they must remain missing values.

In [22]:
# #Product Name wrangle
# pd.set_option('display.max_columns', None)
# df_pn = df_full[df_full['product_name'].isnull()]

# df_pn['product_id'].unique()


# df_prod.isnull().sum()

# df_prod[df_prod['product_name'].isnull()]

# pid = df_prod[df_prod['product_name'].isnull()]
# pid_nan = pid['product_id'].tolist()
# pid_nan

# df_full.loc[df_full['product_id'].isin(pid_nan), 'product_name']

Wrangling the full dataset

In [23]:
#drop unneeded columns, indexes from past merges.
df_full.drop(columns=['Unnamed: 0.1', 'Unnamed: 0_x'], inplace=True)

In [24]:
df_full.drop(columns=['Unnamed: 0_y'], inplace=True)

In [25]:
df_full.columns.tolist()

['order_id',
 'customer_id',
 'customer_order_number',
 'orders_day_of_week',
 'order_hour_of_day',
 'days_between_last_order',
 'first_order',
 'product_id',
 'add_to_cart_order',
 'reordered',
 'product_name',
 'aisle_id',
 'department_id',
 'prices',
 '_merge',
 'price_range_loc',
 'Busiest Days',
 'busiest_hours_of_day',
 'max_orders',
 'loyalty_flag',
 'avg_cust_spend',
 'Customer_Spend',
 'median_order_frequency',
 'Order_Frequency',
 'Gender',
 'State',
 'Age',
 'dependants',
 'marital_status',
 'income']

In [26]:
#all of these null values make sense. 1st order nulls, 16 product ids that have no name, and incorrect prices. 
df_full.isnull().sum()

order_id                         0
customer_id                      0
customer_order_number            0
orders_day_of_week               0
order_hour_of_day                0
days_between_last_order    2078084
first_order                      0
product_id                       0
add_to_cart_order                0
reordered                        0
product_name                 28171
aisle_id                         0
department_id                    0
prices                        5127
_merge                           0
price_range_loc                  0
Busiest Days                     0
busiest_hours_of_day             0
max_orders                       0
loyalty_flag                     0
avg_cust_spend                   0
Customer_Spend                   0
median_order_frequency           0
Order_Frequency                  0
Gender                           0
State                            0
Age                              0
dependants                       0
marital_status                   0
income                           0
dtype: int64

# export to pkl

In [27]:
df_full.shape

(32434212, 30)

# export

In [28]:
df_full.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'df_customer_09212023.pkl'))